let handler = async (m, { isPrems, conn }) => {
let time = global.db.data.users[m.sender].lastcofre + 0 // 36000000 10 Horas //86400000 24 Horas
if (new Date - global.db.data.users[m.sender].lastcofre < 0) throw `[❗𝐈𝐍𝐅𝐎❗] 𝚈𝙰 𝚁𝙴𝙲𝙻𝙰𝙼𝙰𝚂𝚃𝙴 𝚃𝚄 𝙲𝙾𝙵𝚁𝙴\𝚗𝚅𝚄𝙴𝙻𝚅𝙴 𝙴𝙽 *${msToTime(time - new Date())}* 𝙿𝙰𝚁𝙰 𝚅𝙾𝙻𝚅𝙴𝚁 𝙰 𝚁𝙴𝙲𝙻𝙰𝙼𝙰𝚁`

let img = 'https://qu.ax/wgddL.mp4' 
let texto = `💡 𝙂𝙐Í𝘼 𝘿𝙀 𝘾𝙊𝙈𝘼𝙉𝘿𝙊𝙎 𝙈Á𝙎 𝙐𝙎𝘼𝘿𝙊𝙎 𝙋𝙊𝙍 𝙂𝙍𝙐𝙋𝙊𝙎 💡
(𝘖𝘱𝘵𝘪𝘮𝘪𝘻𝘢 𝘵𝘶 𝘦𝘹𝘱𝘦𝘳𝘪𝘦𝘯𝘤𝘪𝘢 𝘺 𝘭𝘢 𝘥𝘦 𝘵𝘶 𝘨𝘳𝘶𝘱𝘰 𝘤𝘰𝘯 𝘦𝘴𝘵𝘰𝘴 𝘤𝘰𝘮𝘢𝘯𝘥𝘰𝘴)

⚙️ 𝘼𝙘𝙩𝙞𝙫𝙖𝙧 𝙮 𝘿𝙚𝙨𝙖𝙘𝙩𝙞𝙫𝙖𝙧 𝙁𝙪𝙣𝙘𝙞𝙤𝙣𝙚𝙨
	•	.𝘰𝘯 𝘢𝘶𝘥𝘪𝘰𝘴 → 𝘈𝘤𝘵𝘪𝘷𝘢 𝘭𝘰𝘴 𝘢𝘶𝘥𝘪𝘰𝘴 𝘥𝘦𝘭 𝘣𝘰𝘵.
	•	.𝘰𝘧𝘧 𝘢𝘶𝘥𝘪𝘰𝘴 → 𝘋𝘦𝘴𝘢𝘤𝘵𝘪𝘷𝘢 𝘭𝘰𝘴 𝘢𝘶𝘥𝘪𝘰𝘴 𝘥𝘦𝘭 𝘣𝘰𝘵.
	•	.𝘰𝘯 𝘣𝘪𝘦𝘯𝘷𝘦𝘯𝘪𝘥𝘢 → 𝘈𝘤𝘵𝘪𝘷𝘢 𝘮𝘦𝘯𝘴𝘢𝘫𝘦𝘴 𝘥𝘦 𝘣𝘪𝘦𝘯𝘷𝘦𝘯𝘪𝘥𝘢 𝘺 𝘥𝘦𝘴𝘱𝘦𝘥𝘪𝘥𝘢.
	•	.𝘰𝘧𝘧 𝘣𝘪𝘦𝘯𝘷𝘦𝘯𝘪𝘥𝘢 → 𝘋𝘦𝘴𝘢𝘤𝘵𝘪𝘷𝘢 𝘮𝘦𝘯𝘴𝘢𝘫𝘦𝘴 𝘥𝘦 𝘣𝘪𝘦𝘯𝘷𝘦𝘯𝘪𝘥𝘢 𝘺 𝘥𝘦𝘴𝘱𝘦𝘥𝘪𝘥𝘢.
	•	.𝘰𝘯 𝘮𝘰𝘥𝘰𝘢𝘥𝘮𝘪𝘯 → 𝘚𝘰𝘭𝘰 𝘭𝘰𝘴 𝘢𝘥𝘮𝘪𝘯𝘪𝘴𝘵𝘳𝘢𝘥𝘰𝘳𝘦𝘴 𝘱𝘰𝘥𝘳á𝘯 𝘶𝘴𝘢𝘳 𝘦𝘭 𝘣𝘰𝘵.
	•	.𝘰𝘧𝘧 𝘮𝘰𝘥𝘰𝘢𝘥𝘮𝘪𝘯 → 𝘗𝘦𝘳𝘮𝘪𝘵𝘦 𝘲𝘶𝘦 𝘵𝘰𝘥𝘰𝘴 𝘶𝘴𝘦𝘯 𝘦𝘭 𝘣𝘰𝘵.
	•	.𝘰𝘯 𝘴𝘪𝘮𝘪 → 𝘈𝘤𝘵𝘪𝘷𝘢 𝘦𝘭 𝘤𝘩𝘢𝘵 𝘤𝘰𝘯 𝘦𝘭 𝘣𝘰𝘵.
	•	.𝘰𝘧𝘧 𝘴𝘪𝘮𝘪 → 𝘋𝘦𝘴𝘢𝘤𝘵𝘪𝘷𝘢 𝘦𝘭 𝘤𝘩𝘢𝘵 𝘤𝘰𝘯 𝘦𝘭 𝘣𝘰𝘵.
	•	.𝘰𝘯 → 𝘙𝘦𝘷𝘪𝘴𝘢 𝘵𝘰𝘥𝘰 𝘭𝘰 𝘲𝘶𝘦 𝘥𝘦𝘴𝘦𝘢𝘴 𝘢𝘤𝘵𝘪𝘷𝘢𝘳 𝘰 𝘥𝘦𝘴𝘢𝘤𝘵𝘪𝘷𝘢𝘳.

👋 𝘽𝙞𝙚𝙣𝙫𝙚𝙣𝙞𝙙𝙖𝙨 𝙮 𝘿𝙚𝙨𝙥𝙚𝙙𝙞𝙙𝙖𝙨
	•	.𝘦𝘥𝘪𝘵𝘢𝘳𝘸𝘦𝘭𝘤𝘰𝘮𝘦 𝘗𝘖𝘕 𝘍𝘙𝘈𝘚𝘌 @𝘶𝘴𝘦𝘳 → 𝘗𝘦𝘳𝘴𝘰𝘯𝘢𝘭𝘪𝘻𝘢 𝘦𝘭 𝘮𝘦𝘯𝘴𝘢𝘫𝘦 𝘥𝘦 𝘣𝘪𝘦𝘯𝘷𝘦𝘯𝘪𝘥𝘢.
(𝘌𝘫𝘦𝘮𝘱𝘭𝘰: “🎉 ¡𝘉𝘪𝘦𝘯𝘷𝘦𝘯𝘪𝘥𝘰 @𝘶𝘴𝘦𝘳 𝘢𝘭 𝘨𝘳𝘶𝘱𝘰! ¡𝘌𝘴𝘱𝘦𝘳𝘢𝘮𝘰𝘴 𝘲𝘶𝘦 𝘭𝘢 𝘱𝘢𝘴𝘦𝘴 𝘨𝘦𝘯𝘪𝘢𝘭!”)
	•	.𝘦𝘥𝘪𝘵𝘢𝘳𝘣𝘺𝘦 𝘗𝘖𝘕 𝘍𝘙𝘈𝘚𝘌 @𝘶𝘴𝘦𝘳 → 𝘗𝘦𝘳𝘴𝘰𝘯𝘢𝘭𝘪𝘻𝘢 𝘦𝘭 𝘮𝘦𝘯𝘴𝘢𝘫𝘦 𝘥𝘦 𝘥𝘦𝘴𝘱𝘦𝘥𝘪𝘥𝘢.
(𝘌𝘫𝘦𝘮𝘱𝘭𝘰: “👋 @𝘶𝘴𝘦𝘳, 𝘦𝘴𝘱𝘦𝘳𝘢𝘮𝘰𝘴 𝘷𝘦𝘳𝘵𝘦 𝘱𝘳𝘰𝘯𝘵𝘰. ¡𝘉𝘶𝘦𝘯𝘢 𝘴𝘶𝘦𝘳𝘵𝘦!”)

👑 𝙃𝙚𝙧𝙧𝙖𝙢𝙞𝙚𝙣𝙩𝙖𝙨 𝙥𝙖𝙧𝙖 𝘼𝙙𝙢𝙞𝙣𝙞𝙨𝙩𝙧𝙖𝙙𝙤𝙧𝙚𝙨
	•	.𝘢𝘥𝘮𝘪𝘯𝘴 𝘺 𝙢𝙚𝙣𝙨𝙖𝙟𝙚 → 𝘌𝘯𝘷í𝘢 𝘶𝘯 𝘮𝘦𝘯𝘴𝘢𝘫𝘦 𝘱𝘳𝘪𝘷𝘢𝘥𝘰 𝘢 𝘭𝘰𝘴 𝘢𝘥𝘮𝘪𝘯𝘪𝘴𝘵𝘳𝘢𝘥𝘰𝘳𝘦𝘴 𝘥𝘦𝘭 𝘨𝘳𝘶𝘱𝘰.
	•	.𝘱𝘳𝘰𝘮𝘰𝘵𝘦 @𝙩𝙖𝙜 → 𝘋𝘢 𝘢𝘥𝘮𝘪𝘯 𝘢 𝘶𝘯 𝘶𝘴𝘶𝘢𝘳𝘪𝘰.
	•	.𝘥𝘦𝘮𝘰𝘵𝘦 @𝙩𝙖𝙜 → 𝘙𝘦𝘵𝘪𝘳𝘢 𝘢𝘥𝘮𝘪𝘯 𝘢 𝘶𝘯 𝘶𝘴𝘶𝘢𝘳𝘪𝘰.
	•	.𝘨𝘳𝘶𝘱𝘰 𝘢𝘣𝘳𝘪𝘳 → 𝘈𝘣𝘳𝘦 𝘦𝘭 𝘨𝘳𝘶𝘱𝘰 𝘱𝘢𝘳𝘢 𝘲𝘶𝘦 𝘵𝘰𝘥𝘰𝘴 𝘱𝘶𝘦𝘥𝘢𝘯 𝘦𝘴𝘤𝘳𝘪𝘣𝘪𝘳.
	•	.𝘨𝘳𝘶𝘱𝘰 𝘤𝘦𝘳𝘳𝘢𝘳 → 𝘊𝘪𝘦𝘳𝘳𝘢 𝘦𝘭 𝘨𝘳𝘶𝘱𝘰 𝘱𝘢𝘳𝘢 𝘲𝘶𝘦 𝘴𝘰𝘭𝘰 𝘭𝘰𝘴 𝘢𝘥𝘮𝘪𝘯𝘴 𝘦𝘴𝘤𝘳𝘪𝘣𝘢𝘯.

📢 𝙉𝙤𝙩𝙞𝙛𝙞𝙘𝙖𝙘𝙞𝙤𝙣𝙚𝙨 𝙮 𝙀𝙩𝙞𝙦𝙪𝙚𝙩𝙖𝙨
	•	.𝘵𝘰𝘥𝘰𝘴 𝘺 𝙢𝙚𝙣𝙨𝙖𝙟𝙚 → 𝘔𝘦𝘯𝘤𝘪𝘰𝘯𝘢 𝘢 𝘵𝘰𝘥𝘰𝘴 𝘭𝘰𝘴 𝘪𝘯𝘵𝘦𝘨𝘳𝘢𝘯𝘵𝘦𝘴 𝘥𝘦𝘭 𝘨𝘳𝘶𝘱𝘰.
	•	.𝘯𝘰𝘵𝘪𝘧𝘪𝘤𝘢𝘳 𝘺 𝙢𝙚𝙣𝙨𝙖𝙟𝙚 → 𝘌𝘯𝘷í𝘢 𝘶𝘯 𝘮𝘦𝘯𝘴𝘢𝘫𝘦 𝘢𝘭 𝘨𝘳𝘶𝘱𝘰 𝘴𝘪𝘯 𝘮𝘦𝘯𝘤𝘪𝘰𝘯𝘢𝘳 𝘢 𝘯𝘢𝘥𝘪𝘦.

🔧 𝙃𝙚𝙧𝙧𝙖𝙢𝙞𝙚𝙣𝙩𝙖𝙨 Ú𝙩𝙞𝙡𝙚𝙨
	•	.𝘥𝘦𝘭 → 𝘌𝘭𝘪𝘮𝘪𝘯𝘢 𝘶𝘯 𝘮𝘦𝘯𝘴𝘢𝘫𝘦 𝘥𝘦 𝘢𝘭𝘨𝘶𝘪𝘦𝘯.
	•	.𝘧𝘢𝘯𝘵𝘢𝘴𝘮𝘢𝘴 → 𝘔𝘶𝘦𝘴𝘵𝘳𝘢 𝘢 𝘭𝘰𝘴 𝘪𝘯𝘵𝘦𝘨𝘳𝘢𝘯𝘵𝘦𝘴 𝘪𝘯𝘢𝘤𝘵𝘪𝘷𝘰𝘴.
	•	.𝘮𝘦𝘯𝘶 → 𝘔𝘶𝘦𝘴𝘵𝘳𝘢 𝘵𝘰𝘥𝘰𝘴 𝘭𝘰𝘴 𝘤𝘰𝘮𝘢𝘯𝘥𝘰𝘴 𝘥𝘪𝘴𝘱𝘰𝘯𝘪𝘣𝘭𝘦𝘴 (¡𝘮á𝘴 𝘥𝘦 200!).
	•	.𝘳𝘦𝘱𝘰𝘳𝘵𝘦 𝘺 𝙢𝙚𝙣𝙨𝙖𝙟𝙚 → 𝘌𝘯𝘷í𝘢 𝘶𝘯 𝘳𝘦𝘱𝘰𝘳𝘵𝘦 𝘥𝘦𝘭 𝘣𝘰𝘵 𝘱𝘢𝘳𝘢 𝘴𝘰𝘱𝘰𝘳𝘵𝘦 𝘵é𝘤𝘯𝘪𝘤𝘰.
 
⚡ 𝘼𝙥𝙧𝙤𝙫𝙚𝙘𝙝𝙖 𝙚𝙨𝙩𝙤𝙨 𝙘𝙤𝙢𝙖𝙣𝙙𝙤𝙨 𝙥𝙖𝙧𝙖 𝙜𝙚𝙨𝙩𝙞𝙤𝙣𝙖𝙧 𝙢𝙚𝙟𝙤𝙧 𝙩𝙪 𝙜𝙧𝙪𝙥𝙤 𝙮 𝙢𝙚𝙟𝙤𝙧𝙖𝙧 𝙡𝙖 𝙚𝙭𝙥𝙚𝙧𝙞𝙚𝙣𝙘𝙞𝙖 𝙙𝙚 𝙩𝙤𝙙𝙤𝙨. ¡Ú𝙨𝙖𝙡𝙤𝙨 𝙨𝙖𝙗𝙞𝙖𝙢𝙚𝙣𝙩𝙚!
𝐁𝐨𝐥𝐢𝐥𝐥𝐨 𝐁𝐨𝐭 🥖`

const fkontak = {
	"key": {
    "participants":"0@s.whatsapp.net",
		"remoteJid": "status@broadcast",
		"fromMe": false,
		"id": "Halo"
	},
	"message": {
		"contactMessage": {
			"vcard": `BEGIN:VCARD\nVERSION:3.0\nN:Sy;Bot;;;\nFN:y\nitem1.TEL;waid=${m.sender.split('@')[0]}:${m.sender.split('@')[0]}\nitem1.X-ABLabel:Ponsel\nEND:VCARD`
		}
	},
	"participant": "0@s.whatsapp.net"
}
await conn.sendFile(m.chat, img, 'img.jpg', texto, fkontak)
global.db.data.users[m.sender].lastcofre = new Date * 1
}
handler.command = ['guia'] 
handler.register = true
export default handler
